app/controllers/games_controller.rb

  def create
    game = current_user.games.create(game_params)
    if game.save
---
INSERT INTO "games" ("category", "number_of_questions", "difficulty", "custom_name", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category", "Movies"], ["number_of_questions", "10"], ["difficulty", "hard"], ["custom_name", "My First Game"], ["user_id", 1]]

  def destroy
    game = Game.find(params[:id])
    game.destroy
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = $1  [["id", 1]]