app/controllers/sessions_controller.rb

INSERT INTO "users" ("username", "google_token", "email") VALUES ($1, $2, $3) RETURNING "id"
UPDATE "users" SET "google_token" = $1 WHERE "users"."id" = $2  [["google_token", "ya29.ImOpB8IUI7_q77LCJhPuBJ7wnLOg-Mfv1Ccw-GULlxn7AwFNXqeoNQzZ1rgTwfM_Ydr9LhZcKdBVuKjKImIFo4P2uD58Rm47mDF-3wdFpab5ruAN2mG-wWbZS_c1zJm_1mjA9Zc"], ["id", 1]]
---
  def googleAuth

    # Get access tokens from the google server
    access_token = request.env["omniauth.auth"]
    user = User.from_omniauth(access_token)

    #See helper method above, creates session
    log_in(user)

    # Access_token is used to authenticate request made from the rails application to the google server
    user.google_token = access_token.credentials.token

    # Refresh_token to request new access_token
    # Note: Refresh_token is only sent once during the first request
    refresh_token = access_token.credentials.refresh_token

    user.google_refresh_token = refresh_token if refresh_token.present?

    user.save