app/models/user.rb

  def self.from_omniauth(auth)
    where(email: auth.info.email).first_or_initialize do |user|
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "mackenzie.halliday@gmail.com"], ["LIMIT", 1]]